spec/sem4r/info/fixtures/get-req.xml

<!-- Post to 'https://adwords-sandbox.google.com/api/adwords/info/v201008/InfoService' -->
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns="https://adwords.google.com/api/adwords/cm/v201008" xmlns:s="https://adwords.google.com/api/adwords/info/v201008">
   <env:Header>
      <s:RequestHeader env:mustUnderstand="0">
         <authToken>***censured***</authToken>
         <userAgent>Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)</userAgent>
         <developerToken>***censured***</developerToken>
      </s:RequestHeader>
   </env:Header>
   <env:Body>
      <s:get>
         <s:selector>
            <s:dateRange>
               <min>20100101</min>
               <max>20101212</max>
            </s:dateRange>
            <s:apiUsageType>UNIT_COUNT</s:apiUsageType>
         </s:selector>
      </s:get>
   </env:Body>
</env:Envelope>
